import 'package:flutter/material.dart';

// Colors that we use in our app
const kPrimaryColor = Color(0xFF0C9869);
//const kPrimaryColor = Colors.blue;
const kTextColor = Color(0xFF3C4046);
const kBackgroundColor = Color(0xFFF9F8FD);

const double kDefaultPadding = 20.0;

const duroodAll =<String, String>{
  'Durood e Shafa':'اَللّٰھُمَّ صَلِّ وَ سَلِّمْ وَ بَارِکْ عَلٰی حَبِیْبِکَ شَفِیْعِ الْمُذْنِبِیْنَ وَ عَلٰٓی اٰلِہٖ وَ اَصْحَابِہٖ اَجْمَعِیْنَ',
  'Durood e Mustafa':'اَللّٰھُمَّ صَلِّ وَ سَلِّمْ وَ بَارِکْ عَلٰی حَبِیْبِکَ الْمُصْطَفٰی وَ عَلٰٓی اٰلِہٖ؁',
  'Durood e Hazarah':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَ عَلٰی اٰلِ سَیِّدِنَا مُحَمَّدٍ بِعَدَدِ کُلِّ ذَرَّۃٍ مِّائَۃَ اَلْفِ اَلْفِ مَرَّۃٍ وَّ بَارِکْ وَ سَلِّمْ؁',
  'Durood e Habib':'اَلصَّلٰوۃُ وَالسَّلَامُ عَلَیْکَ یَارَسُوْلَ اللّٰہِ وَ عَلٰی اٰلِکَ وَ اَصْحَابِکَ یَا حَبِیْبَ اللّٰہِ',
  'Durood e Shifa':'اَللّٰہُمَّ صَلِّ وَ سَلِّمْ وَ بَارِکْ عَلٰی سَیِّدِنَاوَ مَوْلَانَا مُحَمَّدٍ طِبِّ الْقُلُوْبِ وَ دَوَآءِھَا وَ عَافِیَۃِ الْاَبْدَانِ وَ شِفَاءِھَا وَ نُوْرِ الْاَبْصَارِ وَ ضِیَآءِھَا وَ اٰلِہٖ وَ صَحْبِہٖ دَآئِمًا اَبَدًا',
  'Durood e Khamsa':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ بِعَدَدِ مَنْ صَلّٰی عَلَیْہِ وَ صَلِّ عَلٰی مُحَمَّدٍ کَمَا تُحِبُّ وَ تَرْضٰی بِاَنْ تُصَلِّیَ عَلَیْہِ وَ صَلِّ عَلٰی مُحَمَّدٍ کَمَا اَمَرْتَنَا بِالصَّلٰوۃِ عَلَیْہِ وَ صَلِّ عَلٰی مُحَمَّدٍ کَمَا تَنْبَغِی الصَّلوٰۃُ عَلَیْہِ؁',
  'Durood e Sa\'adat':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ عَدَدَ مَا فِیْ عِلْمِ اللہِ صَلٰوۃً دَآئِمَۃً بِدَوَامِ مُلْکِ اللہِ',
  'Durood e Maahi':'o یَا قَدِیْمُ یَا دَآئِمُ یَا حَیُّ یَا قَیُّوْمُ یَا وِتْرُ یَا اَحَدُ یَا صَمَدُ یَا مَنْ لَّمْ یَلِدْ وَ لَمْ یُوْلَدْ وَ لَمْ یَکُنْ لَّہٗ کُفُوًااَحَدٌ بِرَحْمَتِکَ یَا اَرْحَمَ الرَّاحِمِیْنَo',
  'Durood e Batin':'صَلَّی اللہُ عَلَی النَّبِیِّ الاُمِّیِّ وَ اٰلِہٖ وَ سَلَّمَ صَلٰوۃً وَّ سَلاَمًا عَلَیْکَ یَا رَسُوْلَ اللہِ؁',
  'Durood e Ghausia':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا وَ مَوْلَانَا مُحَمَّدٍ مَّعْدِنِ الْجُوْدِ وَ الْکَرَمِ وَ اٰلِہٖ وَ بَارِکْ وَ سَلِّمْ۔',
  'Durood e Jummah':'اَللّٰہُمَّ صَلِّ عَلٰی مُحَمَّدِ نِ النَّبِیِّ الْاُمِّیِ وَ عَلٰٓی اٰلِہٖ وَ سَلِّمْ تَسْلِیْمًا',
  'Durood e Mustajab ul Da\'awat':'صَلَّی اللہُ عَلَی النَّبِیِّ الاُمِّیِّ الْکَرِیْمِ وَ عَلٰی اٰلِہٖ وَ اَصْحَابِہٖ وَ سَلَّمَ؁',
  'Durood e Awwal o Akhir':'صَلَّی اللّٰہُ عَلٰی حَبِیْبِہٖ اَکْرَمِ الْاَوَّلِیْنَ وَ الْاٰخِرِیْنَ وَ عَلٰی اٰلِہٖ وَ اَصْحَابِہٖ وَ بَارِکْ وَ سَلِّمْ؁',
  'Durood e Shab e Jummah':'اَللّٰہُمَّ صَلِّ وَ سَلِّمْ وَ بَارِکْ عَلٰی سَیِّدِنَا مُحَمَّدِ نِ النَّبِیِّ الْاُمِّیِّ الْحَبِیْبِ الْعَالِی الْقَدْرِ الْعَظِیْمِ الْجَاہِ وَ عَلٰٓی اٰلِہٖ وَ صَحْبِہٖ اَجْمَعِیْنَ',
  'Durood e Shab e Khizra':'صَلَّی اللّٰہُ عَلٰی حَبِیْبِہٖ مُحَمَّدٍ وَّ اٰلِہٖ وَ اَصْحَابِہٖ وَ سَلَّمَ؁',
  'Durood e Tunajjaena':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَّ عَلٰٓی اٰلِ سَیِّدِنَا مُحَمَّدٍ صَلٰوۃً تُنَجِّیْنَا بِھَا مِنْ جَمِیْعِ الْاَھْوَالِ وَ الْاٰفَاتِ وَ تَقْضِیْ لَنَا بِھَا جَمِیْعَ الْحَاجَاتِ وَ تُطَھِّرُنَا بِھَا مِنْ جَمِیْعِ السَّیِّئَاتِ وَ تَرْفَعُنَا بِھَا عِنْدَکَ اَعْلَی الدَّرَجَاتِ وَ تُبَلِّغُنَا بِھَا اَقْصَی الْغَایَاتِ مِنْ جَمِیْعِ الْخَیْرَاتِ فِی الْحَیَاتِ وَ بَعْدَ الْمَمَاتِ اِنَّکَ مُجِیْبُ الدَّعَوَاتِ وَ رَافِعُ الدَّرَجَاتِ وَ یَا قَاضِیَ الْحَاجَاتِ وَ یَا کَافِیَ الْمُھِمَّاتِ وَ یَا دَافِعَ الْبَلِیَّاتِ وَ یَا حَلَّ الْمُشْکِلَاتِ اَغِثْنِیْ اَغِثْنِیْ اَغِثْنِیْ یَا اِلٰھِیْ اِنَّکَ عَلٰی کُلِّ شَیْءٍ قَدِیْرٌo',
  'Durood e Boseri':'مَوْلَایَ صَلِّ وَ سَلِّمْ دَائِمًا اَبَدًا عَلٰی حَبِیْبِکَ خَیْرِ الْخَلْقِ کُلِّھِمٖ \10 یَارَبِّ صَلِّ وَ سَلِّمْ دَائِمًا اَبَدًا \10 عَلٰی حَبِیْبِکَ خَیْرِ الْخَلْقِ کُلِّھِم',
  'Durood e Nijat e Waba':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَ عَلٰی اٰلِ سَیِّدِنَا مُحَمَّدٍ بِعَدَدِ کُلِّ دَآءٍ وَّ دَوَآءٍ وَّ بِعَدَدِ کُلِّ عِلَّۃٍ وَّشِفَآءٍ؁',
  'Durood e Na\'emat e Uzma':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَ عَلٰی اٰلِ سَیِّدِنَا مُحَمَّدٍ وَّ اَصْحَابِ سَیِّدِنَا مُحَمَّدٍ وَّ بَارِکْ وَ سَلِّمْ؁',
  'Durood e Kashf':'صَلَّی اللہُ عَلَی نَبِیِّ الرَّحْمَۃِ شَفِیْعِ الْاُمَّۃِ کَاشِفِ الْغُمَّۃِ وَ عَلٰی اٰلِہٖ وَ اَصْحَابِہٖ وَ بَارَکَ وَ سَلَّمَ؁',
  'Durood e Duwami':'اَللّٰہُمَّ صَلِّ عَلَیْھِمْ صَلوٰۃً دَائِمَۃً مُّسْتَمِرَّۃَ الدَّوَامِ عَلٰی مَرِّ اللَّیَالِیْ وَ الْاَیَّامِ مَتَّصِلَۃَ الدَّوَامِ لَا انْقِضَآءَ لَھَا وَ لَا انْصِرَامَ عَلٰی مَرِّ اللَّیَالِیْ وَ الْاَیَّامِ عَدَدَ کُلِّ وَابِلٍ وَّطَلٍّ',
  'Durood e Kamaliya':'اَللّٰھُمَّ صَلِّ وَ سَلِّمْ وَ بَارِکْ عَلٰی سَیِّدِنَا مُحَمَّدِ نِ النَّبِیِّ الْکَامِلِ وَ عَلٰی اٰلِہٖ کَمَا لَانِھَایَۃَ لِکَمَالِہٖ وَ عَدَدَ کَمَالِہٖ؁',
  'Durood e Mohammadi':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَ عَلٰی اٰلِ سَیِّدِنَا مُحَمَّدٍ عَبْدِکَ وَ رَسُوْلِکَ النَّبِیِّ الْاُمِیِّ بَعَدَدِ اَنْفَاسِ الْخَلَائِقِ صَلوٰۃً دَائِمَۃً بِدَوَامِ خَلْقِ اللّٰہِ؁',
  'Durood e Kausar':'اَللّٰہُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ فِی الْاَوَّلِیْنَ وَ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ فِی الْاٰخِرِیْنَ وَ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ فِی النَّبِیِّیْنَ وَ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ فِی الْمُرْسَلِیْنَ وَ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ فِی الْمَلَاِ الْاَعْلٰی اِلٰی یَوْمِ الدِّیْنِ؁',
  'Durood e Husool e Rahmat':'اَللّٰہُمَّ صَلِّ صَلوٰۃً دَائِمَۃً وَ سَلِّمْ سَلَامًا اَبَدًا عَلٰی حَبِیْبِکَ وَ نَبِیِّکَ وَ اٰلِہٖ وَ اَصْحَابِہٖ اَجْمَعِیْنَ فَالْحَمْدُ لِلّٰہِ رَبِّ الْعَالَمِیْنَ',
  'Durood e Naqshbandiya':'اَللّٰہُمَّ اِنَّا نَسْئَلُکَ اَنْ تُصَلِّیَ عَلٰی سَیِّدِنَا مُحَمَّدٍ نِّبْرَاسِ الْاَنْبِیَاءِ وَ نَیِّرِ الْاَوْلِیَآءِ وَ زَبْرِقَانِ الْاَصْفِیَآءِ وَنُوْرِ الثَّقَلَیْنِ وَ ضِیَآءِ الْخَافِقَیْنِ؁',
  'Durood e Khutub':'اَللّٰہُمَّ صَلِّ عَلٰی نُوْرِ الْاَنْوَارِ وَ سِرِّالْاَسْرَارِ وَ تِرْیَاقِ الْاَغْیَارِ سَیِّدِنَا مُحَمَّدِنِ الْمُخْتَارِ وَ اٰلِہِ الْاَطْھَارِ وَ اَصْحَابِہِ الْاَخْیَارِ عَدَدَ نِعَمِ اللّٰہِ وَ اَفْضَالِہٖ؁',
  'Durood e Shazli':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ نِ النُّوْرِ الذَّاتِیِّ السَّارِیْ فِیْ جَمِیْعِ الْاٰثَارِ وَ الْاَسْمَآءِ وَ الصِّفَاتِ وَ عَلٰی اٰلِہٖ وَ صَحْبِہٖ وَ سَلِّمْ',
  'Durood e Deedar':'اَللّٰھُمَّ صَلِّ عَلٰی سَیِّدِنَا مُحَمَّدٍ وَ عَلٰی اٰلِ سَیِّدِنَا مُحَمَّدٍ کَمَا تُحِبُّ وَ تَرْضَیٰ لَہٗ؁',
  'Durood e Razvia':'صَلَّی اللہُ عَلَی النَّبِیِّ الاُمِّیِّ وَ اٰلِہٖ صَلَّی اللہُ عَلَیْہِ وَ سَلَّمَ صَلٰوۃً وَّ سَلاَمًا عَلَیْکَ یَا رَسُوْلَ اللہِ۔'

};


const dua_key=['Saheri','Iftaar','Ramadaan Dua','Taraweeh'];
const ashra_key=['Rehamat Ashra','Maghfirat Ashra','Jahannam Najaat'];


const dua_small=<String,String>{
  'Moon Sigth':'اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالإِيمَانِ وَالسَّلاَمَةِ وَالإِسْلاَمِ رَبِّي وَرَبُّكَ اللَّهُ',
  'Saheri':'وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ',
  'Iftaar':'اَللّٰهُمَّ اِنَّی لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ',
  'Taraweeh':'سُبْحَانَ ذِی الْمُلْکِ وَالْمَلَکُوْتِ ط سُبْحَانَ ذِی الْعِزَّةِ وَالْعَظَمَةِ وَالْهَيْبَةِ وَالْقُدْرَةِ وَالْکِبْرِيَآئِ وَالْجَبَرُوْتِ ط سُبْحَانَ الْمَلِکِ الْحَيِ الَّذِی لَا يَنَامُ وَلَا يَمُوْتُ سُبُّوحٌ قُدُّوْسٌ رَبُّنَا وَرَبُّ الْمَلَائِکَةِ وَالرُّوْحِ ط اَللّٰهُمَّ اَجِرْنَا مِنَ النَّارِ يَا مُجِيْرُ يَا مُجِيْرُ يَا مُجِيْر',
  'Rehamat Ashra':'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ',
  'Maghfirat Ashra':'اَسْتَغْفِرُ اللہَ رَبِّی مِنْ کُلِّ زَنْبٍ وَّ اَتُوْبُ اِلَیْہِ',
  'Jahannam Najaat':'اَللَّهُمَّ أَجِرْنِي مِنَ النَّارِ',
  'Sab E Qadr':'اَللّٰہُمَّ اِنَّکَ عَفُوّتُحِبُّ الْعَفْوَفَاعْفُ عَنِّ',
  'Ramadaan Dua':
  """● Ae Allah hamri jaban par kalmae tayybah hamesha jari rakh
  
● Ae Allah hame kamil iman naseeb farma aur puri hidayat ataa farma

● Ae Allah hame pure ramadaan neamate ,anvaa va barkat se malamal

● Ae Allah hap par apni rehmat najil farma,karam ki barish farma aur rizke halat ataa farma

● Ae Allah hame deene islam ke ehkam par mukammal taur par amal karne vala bana de

● Ae Allah tu hame apna mohataj bana kisi gair ka mohataj na bana

● Ae Allah hame lailatul qadr naseeb farma

● Ae Allah haje maqbool va mamabroor naseeb farma

● Ae Allah hame joth,bughaz va keenah,buraia jagade, fasad se door rakh

● Ae Allah hamse tangdasti khouf ghabrahat aur karj ke boj do farma

● Ae Allah hamare sgeerah aur kabeerah gunaaho ko maaf farma

● Ae Allah humko dajjal ke fitne, shaitan aur nafs ke shar se mafuj rakh

● Ae Allah aurton ko parde ki poori poori pabandi karne ki toufik ataa farma

● Ae Allah har choti badi bimari se hame aur kul momineen va mominaat ko mahfooj rakh

● Ae Allah hame taqwa aur paherejgari ataa farma

● Ae Allah hame huzur e aqdas ﷺ ke pyare tarike par kaym rakh

● Ae Allah hame huzur e aqram ﷺ ki sunnat par chalne ki toufik ataa farma

● Ae Allah  hame kayaamat ke din huzur ﷺ ke hatho se jame kausar naseeb farma

● Ae Allah hame kayamat kee din huzur ﷺ ki shifaat naseeb farma

● Ae Allah tu apni mohabbat aur hamare aqa ﷺ mohabbat hamre dilo mein dalde

● Ae Allah hame maut ki sakhti aur kabr ke ajaab se bachaa

● Ae Allah munkar nakeer ke sawalat aasan farma

● Ae Allah hame kayamat ke roz apna deedar naseeb farma

● Ae Allah hame jannatul firdos me jagah ataa farma

● Ae Allah hame kayam at ki garmi aur jahannum ki aag se mahfuz farma

● Ae Allah hame tamaam momineen va mominaat ko hashr ki rusvayio se bacha

● Ae Allah naam aamal hamre dahine hath me naseeb farma

● Ae Allah apne arsh ke saye me jagah ataa farma

● Ae Allah pul sirrat par bijli ki tarah gujrne ki toufik ataa frama

● Ae Allah hame dono jaha me rasoole paak ﷺ ka gulam banae rakh"""
};



